---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Schema.VendorId
source: html/4c96e65d-07cc-4e85-a176-b2b8c33ba6b2.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.VendorId Property

The id of the third-party vendor that may access entities of this Schema under the
 Vendor access level.

## Syntax (C#)
```csharp
public string VendorId { get; }
```